[
   {
      "id": 1,
      "title": "Flutter for Application Development",
      "tagline": "",
      "category": "workshop",
      "rounds": [
         {
            "id": 1,
            "title": "Day 1",
            "description": "• Intro of OOP Concepts• What is Flutter and Dart?• How flutter renders the widgets• Simple contact details app development which you can share with others by creating the build• What is API and how we can integrate it?• Weather app using open weather API"
         },
         {
            "id": 2,
            "title": "Day 2",
            "description": "• What is project structure in flutter?• What is state and state management?• Explaining BLoC State Management• Recreate weather app using BLoC"
         }
      ]
   },
   {
      "id": 2,
      "title": "Technotainment",
      "tagline": "Full off tech senses",
      "category": "tech",
      "rounds": [
         {
            "id": 1,
            "title": "TechMaps",
            "tagline": "The end is the new beginning",
            "duration": "25min",
            "description": "Here participants would be divided into the group of 4 where they will get a random word from the announcer and the timer for 10 seconds will start. As soon as the timer starts, that particular group must come-up with a word which starts with the last letter of the previous word given by the announcer and it should make some technical sense.."
         },
         {
            "id": 2,
            "title": "Never Have I Ever…",
            "tagline": "If You Can’t Convince Them, Confuse Them.",
            "duration": "25min",
            "description": "Here participants would be divided into the group of 4 where they will be given a professional industry or company or technology about which they would have to debate but with a twist in it which is that the company would have to roast the opposition for example"
         },
         {
            "id": 3,
            "title": "IdeoThon",
            "tagline": "Blend your ideas and serve them hot!!",
            "duration": "25min",
            "description": "Participants will have to create their own startup idea and pitch these idea to the heads, the pitch may include their startup theme their startup required technologies and their vision towards their startup and how will they grow their startup."
         }
      ]
   },
   {
      "id": 3,
      "title": "Mysteriopolis",
      "tagline": "Great Mystery Begin with Great Stories Fetched beyond eons",
      "category": "tech",
      "rounds": [
         {
            "id": 1,
            "title": "Tic-Tech-Toe",
            "tagline": "Life is a game of tic-tac-toe, constantly waiting for the next X or O.",
            "duration": "25min",
            "description": "Participants will be provided with a tic-tac-toe puzzle and a link of google form. Participants will be grouped randomly in a team of 2 where they will compete with other teams. The team which wins the game of tic-tac-toe will be further qualifying. In the event of tie, the group with the maximum number of questions solved will be the winner."
         },
         {
            "id": 2,
            "title": "TechOps",
            "tagline": "To catch a criminal, think like a criminal",
            "duration": "25min",
            "description": "Teams have to solve clues related to the “MURDER OF SHAWN” on basis of there technical knowledge , which will lead to series of clues about murder of shawn. Team who solves all the clue and finds the murderer will win and will get qualify for the next round."
         },
         {
            "id": 3,
            "title": "Squid Game (Red Light, Green Light)",
            "tagline": "Shhhhh don’t move!!!!!",
            "duration": "25min",
            "description": "Participants will have to create their own startup idea and pitch these idea to the heads, the pitch may include their startup theme their startup required technologies and their vision towards their startup and how will they grow their startup."
         }
      ]
   },
   {
      "id": 4,
      "title": "Bollywood Beats",
      "tagline": "Hamare Tevar Alag hai",
      "category": "non-tech",
      "rounds": [
         {
            "id": 1,
            "title": "Battle of Lyrics",
            "description": "From the incomplete lyrics displayed on the screen participants have to complete the further 2 lines of lyrics in given time limit."
         },
         {
            "id": 2,
            "title": "Melody",
            "description": "Participants have to guess the song name by its background music which would be without lyrics in given time limit."
         },
         {
            "id": 3,
            "title": "Bollywood Anime",
            "tagline": "Shhhhh don’t move!!!!!",
            "duration": "25min",
            "description": "In this round participants have to guess the movie name from the given pictures of actor, actress at particular scene from the movie in the form of Anime or Cartoon."
         }
      ]
   },
   {
      "id": 5,
      "title": "Mentos Zindagi",
      "tagline": "Dimag Ki Baati Jalao",
      "category": "non-tech",
      "rounds": [
         {
            "id": 1,
            "title": "Kahoot",
            "description": "Questions on this quiz will deal with logic. Because time is one of the determining factors, it is important to answer the questions as quickly as possible."
         },
         {
            "id": 2,
            "title": "The Big Picture",
            "description": "During the presentation, participants will view a doodle. The task is to identify colored items and write them down."
         },
         {
            "id": 3,
            "title": "Galti Se Mistake",
            "description": "Identify the wrong answer from the given options."
         }
      ]
   },
   {
      "id": 6,
      "title": "Atrangi Mela",
      "tagline": "Socho Kuch Aur, Hai Kuch Aur!",
      "category": "non-tech",
      "rounds": [
         {
            "id": 1,
            "title": "Riddle Marathon",
            "description": "First we will give brief about the game to the participants. In this game the group will be given riddles and they have to answer them in a particular time limit. Group with the maximum number of right answers will be going to the next round!"
         },
         {
            "id": 2,
            "title": "Word Scramble",
            "description": "The group will be given some alphabets from which they have to form maximum number of words in a limited time period."
         },
         {
            "id": 3,
            "title": "Reel it to win it",
            "description": "Finalist will be given a place in form of riddle. They will solve the name of place and go to their respective place and make a reel there. Song will be given from prior only. The most entertaining reel will be declared as winner!"
         }
      ]
   }
]